Repository: Leksiqq/Edifact.Net
Catalog: Edifact/Properties/labels.*.resx
Languages: ru

# UNKNOWN_SEGMENT
source: Unknown segment '{0}' was found at line {L0}, col {C0}.
ru: Неизвестный сегмент '{0}' встретился в строке {L0}, колонке {C0}.

# UNEXPECTED_SEGMENT
source: Unexpected segment '{0}' was found at line {L0}, col {C0}.
ru: Неподходящий сегмент '{0}' встретился в строке {L0}, колонке {C0}.

# FAILED_UNZIP
source: Failed unzip {0}, try use external unzip program.
ru: Ошибка распаковки {0}. Попробуйте использовать внешний архиватор.

# USING_EXTERNAL_UNZIP
source: Using external unzip: {0}
ru: Используется внешний архиватор: {0}

# FILE_FOR_DIRECTORY_NOT_FOUND
source: '{0}' File for directory '{1}' not found.
ru: Файл '{0}' для директории '{1}' не обнаружен.

# UNSL_MESSAGE
source: {0}: using 'unsl' File for directory '{1}'.
ru: '{0}': используется 'unsl' файл для директории '{1}'.

# RECEIVING_DIRECTORY
source: Receiving directory: {0}
ru: Получаем директорию {0}.

# DIRECTORY_NOT_FOUND
source: Directory '{0}' not found at '{1}'.
ru: Директория '{0}' не обнаружена по ссылке '{1}'.

# NO_ENUM_SIMPLE_TYPES
source: {0}: no simple types with enumeration found.
ru: '{0}': не обнаружены простые перечислимые типы.

# MESSAGE_NOT_FOUND
source: Message '{0}' for directory '{1}' not found.
ru: Сообщение '{0}' для директории '{1}'не обнаружено.

# LOAD_FIXED_FILE
source: Loading fixed file: {0}.
ru: Загружается исправленный файл: {0}.

source: Invalid structure.
ru: Неверная структура.

# EXCEPTION_PARSING_MESSAGE
source: Error while building message '{0}' for directory '{1}' at {2}:{3}
ru: Ошибка построения сообщения '{0}' для директории '{1}' в {2}:{3}

# NO_ITEMS_FOR_ELEMENT
source: '{0}': no items for element '{1}' found.
ru: '{0}': не обнаружено items элемента '{1}'

# NO_ITEMS_FOR_COMPLEX_TYPE
source: '{0}': no items for complex type '{1}' found.
ru: '{0}': не обнаружено items сложного типа '{1}'

# NO_SIMPLE_TYPES
source: '{0}': no simple types found.
ru: '{0}': не обнаружены простые типы.

# EDIFACT_DOWNLOADER_USAGE
source: Usage: {0} ARGS ARGS: /m, --message {{MESSAGE|#}} - message type (# for no message, all messages if omitted) /d, --directories LIST - message directory(ies) divided with commas and minuses for intervals (for example: "D97B,D10A-D11B") /n, --ns NS - EDIFACT namespace substitution /t, --target-folder PATH - target folder where schemas will be placed --tmp-folder PATH - temporary folder /p, --proxy http[s]://[USER[:PASSWORD]@]ADDRESS:PORT - use proxy for download --connection-timeout SECONDS - connection timeout of web client
ru: Использование: {0} АРГУМЕНТЫ АРГУМЕНТЫ: /m, --message {{MESSAGE|#}} - тип сообщения (# если загрузка сообщений не требуется, все сообщения, если опущен) /d, --directoriy LIST - директория(и) сообщений, разделённые запятыми и минусами для интервала (например: "D97B,D10A-D11B") /n, --ns NS - пространство имён генерируемых схем (по умолчанию EDIFACT) /s, --schemas-root URI - URI для размещения сгенерированных схем --tmp-folder PATH - временный каталог /p, --proxy http[s]://[USER[:PASSWORD]@]ADDRESS:PORT - использовать прокси сервер для скачивания --connection-timeout SECONDS - таймаут соединения веб-клиента

# KEY_ALREADY_USED
source: The key '{0}' is already used.
ru: Ключ '{0}' уже был применён.

# MISSED_KEY_VALUE
source: The value for key '{0}' is missed.
ru: После ключа '{0}' пропущено значение аргумента.

# UNKNOWN_KEY
source: The key '{0}' is unknown.
ru: Неизвестный ключ '{0}'.

# DOWNLOAD_MESSAGE
source: Downloading message '{0}:{1}'.
ru: Получаем сообщение '{0}:{1}'.

# NO_SIMPLE_TYPES_FOUND
source: {0}: no simple types found.
ru: {0}: простые типы не обнаружены.

# NO_TYPES_FOUND
source: {0}: no composite types found.
ru: {0}: составные типы не обнаружены.

# NO_SEGMENTS_FOUND
source: {0}: no segments found.
ru: {0}: сегменты не обнаружены.

# UNEXPECTED_LINE
source: Unexpected line ({0}): {1}
ru: Неожиданная строка ({0}): {1}

# DATA_ELEMENT_NOT_FOUND
source: Data element '{0}' not found.
ru: Элемент данных '{0}' не обнаружен.

# INVALID_DIRECTORY_NAME_OR_INTERVAL
source: Invalid directory name or interval: '{0}'.
ru: Неверное имя директории или интервал: {0}.

# INVALID_SEQUENCE
source: '{0}' at position '{1}' expected '{2}' but got '{3}'.
ru: '{0}' на позиции '{1}' ожидался '{2}', обнаружен '{3}'.

# MISSED_MANDATORY_KEY
source: Mandatory key '{0}' is missed.
ru: Пропущен обязательный параметр: '{0}'.

# NOT_XML_SCHEMA
source: File '{0}' does not contains XML Schema.
ru: Файл '{0}' не содержит XML схему.

# URI_SCHEME_NOT_SUPPORTED
source: Uri scheme is not supported: '{0}'.
ru: Схема URI не поддерживается: '{0}'.

# NOT_EDIFACT_SCHEMA
source: File '{0}' does not contains XML Schema for EDIFACT.
ru: Файл '{0}' не содержит XML схему для EDIFACT.

# PARSER_CLI_USAGE
source: Usage: {0} OPTIONS where OPTIONS: --{1} URI (Mandatory) The root folder URI where EDIFACT Xml-schemas are placed. --{2} URI (Mandatory) The URI of input EDIFACT interchange file. --{3} URI (Mandatory) The URI of output folder, where message Xml-files will be placed. --{4} "<Type1>=<suffix1>;..." (Optional) List of type=suffix pairs separated with semicolon (;) of EDIFACT messages Xml-schemas files to use instead of original ones. --{5} ENCODING (Optional) Encoding name to use when failed to extract from data. --{6} yes|no (Optional, default yes) Allows to check EDIFACT data a bit less strictly. --{7} SIZE (Optional) Internal buffer size for possible optimization.
ru: Использование: {0} АРГУМЕНТЫ где АРГУМЕНТЫ: --{1} URI (Обязательно) Корневой URI папки, где расположены EDIFACT Xml-схемы. --{2} URI (Обязательно) URI входящего файла обмена EDIFACT. --{3} URI (Необязательно) URI папки для выходных xml-файлов сообщений. --{4} "<Type1>=<suffix1>;..." (Необязательно) Список type=suffix пар, разделённых точкой с запятой (;) сопоставляющий типу EDIFACT сообщения суффикс файла Xml-схемы, используемого вместо оригинального. --{5} ENCODING (Необязательно) Имя кодировки файла, если не может быть определена из самих данных. --{6} yes|no (Необязательно, по умолчанию yes) Позволяет проверять EDIFACT не слишком строго. --{7} SIZE (Необязательно) Размер внутреннего буфера для возможной оптимизации.

# SCHEMA2TREE_USAGE
source: Usage: {0} ARGS ARGS: /s, --schema URI - URI of XML Schema file. /o URI - URI of output file. /w, --width SIZE - width of output file.
ru: Использование: {0} АРГУМЕНТЫ где АРГУМЕНТЫ: --{1} URI (Обязательно) Корневой URI папки, где расположены EDIFACT Xml-схемы. --{2} TYPE (Обязательно) Тип EDIFACT-сообщения. --{3} DIRECTORY (Обязательно) Директория EDIFACT-сообщения. --{4} URI (Mandatory) URI выходного файла. --{5} CODE (Необязательно, по умолчанию UN) Контролирующее агентство EDIFACT-сообщения. --{6} SUFFIX (Необязательно) Суффикс EDIFACT-сообщения. --{7} SIZE (Необязательно, по умолчанию {8}) Ширина страницы выходного файла.
